Управление_торговлей.ПБТ/src/Documents/вт_ПланСборки/вт_ПланСборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ПланСборки</name>
  <basedOn>Document.вт_ЗаказВПроизводство</basedOn>
  <registerRecords>AccumulationRegister.вт_ПланСборкиТоваров</registerRecords>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество для сборки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантКомплектации</name>
      <type>
        <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГотоваяПродукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантКомплектации</name>
      <type>
        <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество для сборки - определяется исходя из варианта сборки и количества готовой продукции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/AccumulationRegisters/вт_ПланСборкиТоваров/вт_ПланСборкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вт_ПланСборкиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПроизводства</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Catalogs/ВариантыКомплектацииНоменклатуры/ВариантыКомплектацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ce49200-30ea-44d6-97f7-390bc2c5dee9">
  <name>ВариантыКомплектацииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="354a86ec-cf4f-4299-a60e-80a77f619e67">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5f89eb00-a169-4f6d-b578-df09d9d8a64e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89be4936-f4ef-4a03-84cf-c27217b6cba4">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6219b3de-db0c-4d3e-b4f2-58419c6950a0">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Documents/вт_ПланСборки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.вт_ЗаказВПроизводство") Тогда
		 ЭтотОбъект.ДокументОснования = ДанныеЗаполнения;
		 ЭтотОбъект.Склад = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_СкладПроизводства");
		 ЭтотОбъект.ДокументОснования = ДанныеЗаполнения;
		 //Заполняем план сборки из заказ производства
		ЭтотОбъект.Организация = ДанныеЗаполнения.Организация; 
		Для Каждого СтрокаЗаказа из ДанныеЗаполнения.ТОвары Цикл
			пВариантКомплектации = ОсновнойВариантКомплектации(СтрокаЗаказа.Номенклатура);
			Если пВариантКомплектации.Пустая()  Тогда
				Продолжить;
			КонецЕсли;
		 НовСтрока = ЭтотОбъект.Товары.Добавить();
		 НовСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
		 НовСтрока.Количество = СтрокаЗаказа.Количество;
		 НовСтрока.ВариантКомплектации = пВариантКомплектации; 
		 
		 ЗагрузитьВложенныеЭлементыКомплекта(НовСтрока.Номенклатура, НовСтрока.Количество, НовСтрока.ВариантКомплектации);
		 
	 	КонецЦикла;
	    ОбновитьТекущиеОстаткиПоПлануГотовойПродукции();
		
   КонецЕсли;
КонецПроцедуры	

Процедура ЗагрузитьВложенныеЭлементыКомплекта(пНоменклатура, пКоличество, пВариантКомплектации)

	Для Каждого СтрокаСостава из пВариантКомплектации.Товары Цикл
				НовСтрокаКомпл = ЭтотОбъект.Комплектующие.Добавить();
				
				НовСтрокаКомпл.ВариантКомплектации = пВариантКомплектации;
				НовСтрокаКомпл.ГотоваяПродукция = пНоменклатура;
				НовСтрокаКомпл.Номенклатура = СтрокаСостава.Номенклатура;
				НовСтрокаКомпл.Количество = пКоличество * СтрокаСостава.Количество;
				
				пВариант = ОсновнойВариантКомплектации(СтрокаСостава.Номенклатура);
			
				Если пВариант.Пустая()  Тогда //Значит это конечное изделие
					
				Иначе //Это тоже нужно собирать	
					НовСтрокаТовара = ЭтотОбъект.Товары.Добавить();
					НовСтрокаТовара.Номенклатура =  СтрокаСостава.Номенклатура;
					НовСтрокаТовара.Количество = НовСтрокаКомпл.Количество;
					НовСтрокаТовара.ВариантКомплектации = пВариант;
					
					ЗагрузитьВложенныеЭлементыКомплекта(НовСтрокаТовара.Номенклатура, НовСтрокаТовара.Количество, НовСтрокаТовара.ВариантКомплектации);
				КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры	


Процедура ОбновитьТекущиеОстаткиПоПлануГотовойПродукции()
	//По таблице Товары определить текущие остатки и скорректировать план в производство
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ_ПлановыеТовары.Номенклатура
	                      |ПОМЕСТИТЬ ВТ_ПЛАНОВЫЕ
	                      |ИЗ
	                      |	&ВТ_ПлановыеТовары КАК ВТ_ПлановыеТовары
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ПЛАНОВЫЕ.Номенклатура,
	                      |	естьnull(ТоварыОрганизацийОстатки.КоличествоОстаток,0) КАК КоличествоОстаток,
	                      |	естьnull(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК ВНаличииОстаток
	                      |ИЗ
	                      |	ВТ_ПЛАНОВЫЕ КАК ВТ_ПЛАНОВЫЕ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(&ГраницаОстатка, Организация = &Организация) КАК ТоварыОрганизацийОстатки
	                      |		ПО ВТ_ПЛАНОВЫЕ.Номенклатура = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ГраницаОстатка, Склад В (&Склады)) КАК ТоварыНаСкладахОстатки
	                      |		ПО ВТ_ПЛАНОВЫЕ.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура");	
	МассивСклады = Новый Массив;
	МассивСклады.Добавить(ЭтотОбъект.Склад);
	
	Запрос.УстановитьПараметр("ГраницаОстатка",Новый МоментВремени(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВТ_ПлановыеТовары", ЭтотОбъект.Товары);
	Запрос.УстановитьПараметр("Склады",МассивСклады);
	Запрос.УстановитьПараметр("Организация",ЭтотОбъект.Организация);
	
	ТаблОстатки = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаПлана из ЭтотОбъект.Товары ЦИкл
		   ОтборСтрок = Новый Структура("Номенклатура",СтрокаПлана.Номенклатура);
		   НайденыСтроки = ТаблОстатки.НайтиСтроки(ОтборСтрок);
		   СтрокаПлана.ТекущийОстаток = 0;
		   Если НайденыСтроки.Количество()>0 Тогда
			   СтрокаПлана.ТекущийОстаток = ?(НайденыСтроки[0].КоличествоОстаток>0,НайденыСтроки[0].КоличествоОстаток, НайденыСтроки[0].ВНаличииОстаток);
		   КонецЕсли;
		   
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ОсновнойВариантКомплектации(пНоменклатура) Экспорт
	РезультатОтвета = Справочники.ВариантыКомплектацииНоменклатуры.ПустаяСсылка();
	ВыборкаВариантов = Справочники.ВариантыКомплектацииНоменклатуры.Выбрать(,пНоменклатура);
	Пока ВыборкаВариантов.Следующий() Цикл
		Если ВыборкаВариантов.Основной И НЕ ВыборкаВариантов.ПометкаУдаления Тогда
			РезультатОтвета = ВыборкаВариантов.Ссылка;
		КонецЕсли;	
	КонецЦикла;
	 
	Возврат РезультатОтвета;
КонецФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	ЗаписатьПланСборки();
КонецПроцедуры	

Процедура ЗаписатьПланСборки()
 	Движения.вт_ПланСборкиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.вт_ПланСборкиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ЗаказПроизводства = ДокументОснования;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	 
КонецПроцедуры
